  This PR will be making the following changes to the resources:
  <details>
    <summary>Terraform plan</summary>

    ```
    
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_image.app will be created
  + resource "docker_image" "app" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/online-classifier-app/app"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "f8a591c55d4d2e102d673209f49048fedd48a78e"
        }

      + build {
          + build_args   = {
              + "HOST_URL" = "https://service-deployment-kttol2mhha-nw.a.run.app/"
            }
          + cache_from   = []
          + context      = "/workspace/terraform/.."
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # docker_registry_image.app will be created
  + resource "docker_registry_image" "app" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = false
      + name                 = "eu.gcr.io/online-classifier-app/app"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)
    }

  # google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west2"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "service-deployment"
    }

  # google_cloud_run_v2_service.default will be created
  + resource "google_cloud_run_v2_service" "default" {
      + conditions              = (known after apply)
      + etag                    = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west2"
      + name                    = "service-deployment"
      + observed_generation     = (known after apply)
      + project                 = (known after apply)
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = 4
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = (known after apply)

              + resources {
                  + limits = {
                      + "cpu"    = "2"
                      + "memory" = "1Gi"
                    }
                }
            }

          + scaling {
              + max_instance_count = 1
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_container_registry.registry will be created
  + resource "google_container_registry" "registry" {
      + bucket_self_link = (known after apply)
      + id               = (known after apply)
      + location         = "EU"
      + project          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
    ```
  </details>
